___

<a href='https://www.schoolofds.com'><center><img src='../schoolofds_logo.png'/></center></a>
___
<center><em>Content Copyright by School of Data Science #schoolofds</em></center>

# Missing Data

Let's show a few convenient methods to deal with Missing Data in pandas:

In [1]:
import numpy as np
import pandas as pd

In [20]:
df = pd.DataFrame({'A':[1,2,np.nan,5,7],
                  'B':[5,np.nan,np.nan,12,13],
                  'C':[1,2,3,4,5]})

In [21]:
df

     A     B  C
0  1.0   5.0  1
1  2.0   NaN  2
2  NaN   NaN  3
3  5.0  12.0  4
4  7.0  13.0  5

In [9]:
df.dropna()

     A     B  C
0  1.0   5.0  1
3  5.0  12.0  4
4  7.0  13.0  5

In [10]:
df.dropna(axis=1)

   C
0  1
1  2
2  3
3  4
4  5

In [12]:
df.dropna(thresh=2,axis=0)

     A     B  C
0  1.0   5.0  1
1  2.0   NaN  2
3  5.0  12.0  4
4  7.0  13.0  5

In [13]:
df = df.fillna(value='iit')

In [14]:
df

     A    B  C
0    1    5  1
1    2  iit  2
2  iit  iit  3
3    5   12  4
4    7   13  5

In [25]:
df['B'].mean()

10.0

In [22]:

for i in df.columns:
    df[i].fillna(value = df[i].mean(),inplace=True)

In [23]:
df

      A     B  C
0  1.00   5.0  1
1  2.00  10.0  2
2  3.75  10.0  3
3  5.00  12.0  4
4  7.00  13.0  5

In [17]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# Great Job!